
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 15 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.POSTGRES-USER-FLEXIBLE
  * azurerm_key_vault_secret.POSTGRES-USER-FLEXIBLE-REPLICA
  * azurerm_key_vault_secret.POSTGRES_DATABASE-FLEXIBLE
  * azurerm_key_vault_secret.POSTGRES_DATABASE-FLEXIBLE-REPLICA
  * azurerm_key_vault_secret.POSTGRES_HOST-FLEXIBLE
  * azurerm_key_vault_secret.POSTGRES_HOST-FLEXIBLE-REPLICA
  * azurerm_key_vault_secret.POSTGRES_PORT-FLEXIBLE
  * azurerm_key_vault_secret.POSTGRES_PORT-FLEXIBLE-REPLICA
  * module.sdp_db_user.random_password.sdp_read_user_password
  * module.wa_task_management_api_database_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.wa_task_management_api_database_flexible.azurerm_resource_group.rg[0]
  * module.wa_task_management_api_database_flexible.random_password.password
  * module.wa_task_management_api_database_flexible_replica.azurerm_postgresql_flexible_server.pgsql_server
  * module.wa_task_management_api_database_flexible_replica.azurerm_resource_group.rg[0]
  * module.wa_task_management_api_database_flexible_replica.random_password.password
* Replace
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-USER-FLEXIBLE will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-USER-FLEXIBLE" {
        id                      = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-USER-FLEXIBLE/20518805600e40359671d0b34c6901d7"
        name                    = "cft-task-POSTGRES-USER-FLEXIBLE"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES-USER-FLEXIBLE-REPLICA will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-USER-FLEXIBLE-REPLICA" {
        id                      = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-USER-FLEXIBLE-REPLICA/08fa866b8c324c3fbb9d9b98431b6de6"
        name                    = "cft-task-POSTGRES-USER-FLEXIBLE-REPLICA"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE-FLEXIBLE will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_DATABASE-FLEXIBLE" {
        id                      = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-DATABASE-FLEXIBLE/3318c7cebdd64a079f1227edee0b301c"
        name                    = "cft-task-POSTGRES-DATABASE-FLEXIBLE"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE-FLEXIBLE-REPLICA will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_DATABASE-FLEXIBLE-REPLICA" {
        id                      = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-DATABASE-FLEXIBLE-REPLICA/9026ca516f754e2c801a27e01e7dac7c"
        name                    = "cft-task-POSTGRES-DATABASE-FLEXIBLE-REPLICA"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST-FLEXIBLE will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST-FLEXIBLE" {
        id                      = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-HOST-FLEXIBLE/4a04342c2f59495a83156b590a210a36"
        name                    = "cft-task-POSTGRES-HOST-FLEXIBLE"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST-FLEXIBLE-REPLICA will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST-FLEXIBLE-REPLICA" {
        id                      = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-HOST-FLEXIBLE-REPLICA/284b1607de3b4f0598e7538c548da915"
        name                    = "cft-task-POSTGRES-HOST-FLEXIBLE-REPLICA"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT-FLEXIBLE will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_PORT-FLEXIBLE" {
        id                      = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-PORT-FLEXIBLE/4b7154fa0feb48c4a12cf75047551db9"
        name                    = "cft-task-POSTGRES-PORT-FLEXIBLE"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT-FLEXIBLE-REPLICA will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_PORT-FLEXIBLE-REPLICA" {
        id                      = "https://wa-aat.vault.azure.net/secrets/cft-task-POSTGRES-PORT-FLEXIBLE-REPLICA/1451a16b6c694599b328207296b7a36f"
        name                    = "cft-task-POSTGRES-PORT-FLEXIBLE-REPLICA"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # module.sdp_db_user.data.azurerm_key_vault.sdp_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "sdp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "mi-vault-dev"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "mi-dev-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.sdp_db_user.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      ~ id                      = "https://mi-vault-dev.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-name/df75401143024b98a58ff615e68d79d1" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev" # forces replacement -> (known after apply) # forces replacement
        name                    = "cft-task-postgres-db-flexible-replica-read-user-name"
      ~ resource_id             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/cft-task-postgres-db-flexible-replica-read-user-name/versions/df75401143024b98a58ff615e68d79d1" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/cft-task-postgres-db-flexible-replica-read-user-name" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "df75401143024b98a58ff615e68d79d1" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-dev.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-name" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      ~ id                      = "https://mi-vault-dev.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-password/ccce07a2f41249cb8a84f099cacbb2f6" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev" # forces replacement -> (known after apply) # forces replacement
        name                    = "cft-task-postgres-db-flexible-replica-read-user-password"
      ~ resource_id             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/cft-task-postgres-db-flexible-replica-read-user-password/versions/ccce07a2f41249cb8a84f099cacbb2f6" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/cft-task-postgres-db-flexible-replica-read-user-password" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "ccce07a2f41249cb8a84f099cacbb2f6" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-dev.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-password" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.sdp_db_user.random_password.sdp_read_user_password will be updated in-place
  ~ resource "random_password" "sdp_read_user_password" {
        id               = "none"
        # (13 unchanged attributes hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-aat"
        name                          = "cft-task-postgres-db-flexible-aat"
      ~ tags                          = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2024-10-21T15:21:39Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_resource_group.rg[0] will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-data-aat"
        name     = "cft-task-postgres-db-flexible-data-aat"
      ~ tags     = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2024-10-21T15:21:39Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.wa_task_management_api_database_flexible.random_password.password will be updated in-place
  ~ resource "random_password" "password" {
        id               = "none"
        # (13 unchanged attributes hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-replica-aat"
        name                          = "cft-task-postgres-db-flexible-replica-aat"
      ~ tags                          = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2024-10-21T15:21:39Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_resource_group.rg[0] will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cft-task-postgres-db-flexible-replica-data-aat"
        name     = "cft-task-postgres-db-flexible-replica-data-aat"
      ~ tags     = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2024-10-21T15:21:39Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.random_password.password will be updated in-place
  ~ resource "random_password" "password" {
        id               = "none"
        # (13 unchanged attributes hidden)
    }

Plan: 2 to add, 15 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1270,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->